package Arry0930Thu;

public class Arry0930Tur {

	public static void main(String[] args) {

	}

}
/*

 복습 설명
 데이터 타입 중 기본 타입과 참조 타입.
 기본 타입은 정수, 실수, 논리 타입
 참조 타입은 배열, 열거, 클래스, 인터페이스
	기본 타입과 참조 타입은 엄연히 다르다.	
	참조타입을 할 때는 새로운 방법으로 객체를 선언한다. 기본값을 주는 게 아니라 새로운 걸 만든다. int b[] = new int[5];
	

 힙 영역 : 객체 주소가 생성되는 메모리 영역. (?만들어진 객체는 주소가 항상 존재하니까ㅏㅏㅏㅏ?)
 
 메소드 영역 (static
 클래스가 로딩
 모든 스레드가 공유 !*!
 
 
 힙 영역 (heap)
 객체배열 저장(생성)
 
 jvm 스택(stack)
 frame { } 블럭별.
 
 배열 복사.
 
 
*/